#include "../inc/print_info.h"


void print_menu(void)
{
    printf("\n\tМеню \
        \n0. Выход из программы \
        \nОперации для работы с очередью массива \
        \n  1. Добавить элемент \
        \n  2. Удалить элемент \
        \n  3. Распечатать очередь\n \
        \nОперации для работы с очередью списка \
        \n  4. Добавить элемент \
        \n  5. Удалить элемент \
        \n  6. Распечатать очередь \
        \n  7. Распечатать массив освободившихся адрессов\n \
        \nМоделирование\
        \n  8. очредь-массив\
        \n  9. очередь-список \
        \n10. Замеры времени и памяти");

    printf("\n\nВведите пункт меню: ");
}